# ruff: noqa: E501

import json
from pathlib import Path

import matplotlib.pyplot as plt
import numpy as np
from docx import Document
from docx.enum.text import WD_ALIGN_PARAGRAPH
from docx.oxml.ns import qn
from docx.shared import Cm, Inches, Pt
from evaluate_models import evaluate_models
from train_model import generate_dataset

ROOT = Path(__file__).resolve().parents[1]
TEMPLATE = ROOT / "Шаблон отчета.docx"
OUTPUT = ROOT / "Отчет ai-pricing-service.docx"
REPORTS = ROOT / "reports"
FIGURES = REPORTS / "figures"


def set_paragraph_text(paragraph, text: str, *, body: bool = True) -> None:
    paragraph.clear()
    run = paragraph.add_run(text)
    run.font.name = "Times New Roman"
    run._element.rPr.rFonts.set(qn("w:eastAsia"), "Times New Roman")
    if body:
        run.font.size = Pt(14)
        paragraph.alignment = WD_ALIGN_PARAGRAPH.JUSTIFY
        paragraph.paragraph_format.first_line_indent = Cm(1.25)
        paragraph.paragraph_format.line_spacing = 1.5


def replace_existing_text(paragraph, text: str) -> None:
    if paragraph.runs:
        paragraph.runs[0].text = text
        for run in paragraph.runs[1:]:
            run.text = ""
    else:
        paragraph.add_run(text)


def remove_paragraph(paragraph) -> None:
    element = paragraph._element
    element.getparent().remove(element)


def set_cell_text(cell, text: str) -> None:
    paragraph = cell.paragraphs[0]
    paragraph.clear()
    run = paragraph.add_run(text)
    run.font.name = "Times New Roman"
    run._element.rPr.rFonts.set(qn("w:eastAsia"), "Times New Roman")
    run.font.size = Pt(12)
    paragraph.alignment = WD_ALIGN_PARAGRAPH.CENTER


def build_data_schema(path: Path) -> None:
    fig, ax = plt.subplots(figsize=(11, 4.3))
    ax.set_xlim(0, 11)
    ax.set_ylim(0, 4.3)
    ax.axis("off")

    boxes = [
        (0.3, 2.1, 2.2, 1.8, "Входные данные", "product_id\nhorizon_days\ncurrent_base_price\nis_weekend"),
        (3.2, 2.1, 2.2, 1.8, "Подготовка", "DictVectorizer\ntrain/test split 80/20"),
        (6.1, 2.1, 2.2, 1.8, "ML-модель", "RandomForestRegressor\n120 деревьев"),
        (8.9, 2.1, 1.8, 1.8, "Прогноз", "demand_units"),
        (6.1, 0.25, 2.2, 1.3, "Бизнес-логика", "Ограниченная корректировка\nбазовой цены"),
        (8.9, 0.25, 1.8, 1.3, "Результат", "recommended_price\nconfidence_score"),
    ]
    for x, y, width, height, title, details in boxes:
        ax.add_patch(
            plt.Rectangle(
                (x, y),
                width,
                height,
                facecolor="#eef5fb",
                edgecolor="#356a94",
                linewidth=1.5,
            )
        )
        ax.text(x + width / 2, y + height - 0.32, title, ha="center", va="center", fontsize=11, weight="bold")
        ax.text(x + width / 2, y + height - 0.78, details, ha="center", va="top", fontsize=9)

    arrow = dict(arrowstyle="->", color="#356a94", linewidth=1.5)
    ax.annotate("", xy=(3.2, 3.0), xytext=(2.5, 3.0), arrowprops=arrow)
    ax.annotate("", xy=(6.1, 3.0), xytext=(5.4, 3.0), arrowprops=arrow)
    ax.annotate("", xy=(8.9, 3.0), xytext=(8.3, 3.0), arrowprops=arrow)
    ax.annotate("", xy=(7.2, 1.55), xytext=(7.2, 2.1), arrowprops=arrow)
    ax.annotate("", xy=(8.9, 0.9), xytext=(8.3, 0.9), arrowprops=arrow)
    fig.tight_layout()
    fig.savefig(path, dpi=220, bbox_inches="tight", facecolor="white")
    plt.close(fig)


def build_eda_figure(data: list[dict], path: Path) -> None:
    demand = np.array([row["demand_units"] for row in data])
    products = sorted({row["product_id"] for row in data})
    means = [np.mean([row["demand_units"] for row in data if row["product_id"] == product]) for product in products]

    fig, axes = plt.subplots(1, 2, figsize=(11, 4.3))
    axes[0].hist(demand, bins=14, color="#4c78a8", edgecolor="white")
    axes[0].axvline(demand.mean(), color="#c44e52", linestyle="--", label=f"Среднее: {demand.mean():.2f}")
    axes[0].set_title("Распределение целевой переменной")
    axes[0].set_xlabel("Спрос, ед.")
    axes[0].set_ylabel("Количество наблюдений")
    axes[0].legend(frameon=False)

    labels = [product.replace("-", "-\n", 1) for product in products]
    axes[1].bar(labels, means, color="#59a14f")
    axes[1].set_title("Средний спрос по товарам")
    axes[1].set_xlabel("Идентификатор товара")
    axes[1].set_ylabel("Средний спрос, ед.")
    axes[1].tick_params(axis="x", labelsize=8)
    axes[1].set_ylim(0, max(means) * 1.2)
    for index, value in enumerate(means):
        axes[1].text(index, value + 0.7, f"{value:.1f}", ha="center", fontsize=8)

    fig.tight_layout()
    fig.savefig(path, dpi=220, bbox_inches="tight", facecolor="white")
    plt.close(fig)


def main() -> None:
    FIGURES.mkdir(parents=True, exist_ok=True)
    data = generate_dataset(seed=42, rows=1000)
    comparison = evaluate_models(seed=42, rows=1000)
    (REPORTS / "model_comparison.json").write_text(
        json.dumps(comparison, ensure_ascii=False, indent=2),
        encoding="utf-8",
    )

    schema_path = FIGURES / "data_and_prediction_flow.png"
    eda_path = FIGURES / "eda_summary.png"
    build_data_schema(schema_path)
    build_eda_figure(data, eda_path)

    document = Document(TEMPLATE)
    paragraphs = document.paragraphs

    title = document.tables[1].cell(0, 0).paragraphs[4]
    replace_existing_text(
        title,
        "«Разработка интеллектуального веб-сервиса прогнозирования спроса и расчета рекомендованной цены»",
    )

    content = {
        20: "В розничной торговле цена товара влияет одновременно на объём спроса, выручку и оборачиваемость запасов. Решения, основанные только на фиксированных правилах или экспертной оценке, затрудняют учёт различий между товарными категориями, текущей ценой, горизонтом прогнозирования и календарными факторами. Поэтому актуальна разработка программного сервиса, который получает параметры товара, прогнозирует ожидаемый спрос и формирует ценовую рекомендацию в едином автоматизированном процессе.",
        21: "Задача относится к регрессионному машинному обучению: по набору признаков требуется оценить количество востребованных единиц товара. При этом одной обученной модели недостаточно для эксплуатации. Необходимы проверяемый контракт входных данных, контроль версии артефактов, обработка ошибок, оценка уверенности, программный интерфейс и средства наблюдаемости.",
        22: "В рамках итогового проекта разработан сервис AI Pricing Service. Он принимает идентификатор товара, горизонт прогноза, текущую базовую цену и признак выходного дня. Предобученная модель RandomForestRegressor возвращает прогноз спроса, после чего бизнес-логика рассчитывает рекомендованную цену с ограничением величины корректировки относительно исходной цены.",
        23: "Решение реализовано на FastAPI и предоставляет REST API, веб-интерфейс, пакетный прогноз и пояснение результата. При запуске сервис проверяет версию, структуру и контрольные суммы ML-артефактов, выполняет тестовый прогноз и только после этого сообщает о готовности. Для контейнерного развёртывания используются Docker и Docker Compose, а эксплуатационные метрики публикуются в формате Prometheus.",
        24: "Целью проекта является разработка интеллектуального веб-сервиса для прогнозирования спроса и расчёта рекомендованной цены на основе модели машинного обучения.",
        25: "Для достижения поставленной цели были сформулированы следующие задачи:",
        26: "Проанализировать предметную область и сформировать контракт входных и выходных данных сервиса.",
        27: "Подготовить воспроизводимый набор данных и провести разведочный анализ признаков и целевой переменной.",
        28: "Сравнить базовые регрессионные алгоритмы и выбрать модель по метрикам MAE и RMSE.",
        29: "Реализовать загрузку версионированных артефактов, прогноз спроса и бизнес-логику расчёта рекомендованной цены.",
        30: "Разработать REST API, веб-интерфейс, health checks, логирование и метрики приложения.",
        31: "Обеспечить контейнерный запуск и проверить решение автоматизированными тестами и сквозным сценарием обращения к API.",
        32: "Практическая значимость проекта состоит в создании законченного ML-сервиса, который объединяет подготовку признаков, инференс модели и получение бизнес-результата через стабильный API. Архитектура позволяет заменить синтетические данные реальной историей продаж без изменения внешнего контракта сервиса.",
        35: "В проекте решается задача краткосрочного прогнозирования спроса на товар при заданной базовой цене. Прогноз необходим до принятия ценового решения: ожидаемый повышенный спрос допускает ограниченное увеличение цены, а пониженный спрос приводит к её уменьшению. Такой подход разделяет статистическую оценку спроса и контролируемое бизнес-правило формирования рекомендации.",
        36: "Математически задача формулируется как построение функции регрессии, которая отображает вектор признаков товара и контекста в неотрицательное целое значение ожидаемого спроса. Обучение выполняется вне процесса API, а при запуске приложения загружается готовый sklearn pipeline.",
        37: "Входной вектор содержит четыре признака: строковый product_id, целочисленный горизонт horizon_days от 1 до 14 дней, положительную текущую цену current_base_price и логический признак is_weekend. Категориальный идентификатор преобразуется DictVectorizer, остальные признаки передаются в модель как числовые значения.",
        38: "Основным выходом модели является predicted_demand_units. На его основе сервис вычисляет recommended_price, ограничивая давление спроса диапазоном от минус 12 до плюс 18 процентов. Дополнительно возвращается confidence_score, учитывающий разброс прогнозов отдельных деревьев, выход цены за обучающий диапазон и длину горизонта.",
        39: "Для решения задачи выбран RandomForestRegressor. Ансамбль деревьев способен описывать нелинейную зависимость спроса от цены и взаимодействия признаков без сложного ручного преобразования данных. Модель входит в pipeline вместе с DictVectorizer, что исключает расхождение подготовки признаков между обучением и инференсом.",
        40: "При проектировании системы были приняты следующие ограничения:",
        41: "Горизонт прогноза ограничен интервалом от 1 до 14 дней, а базовая цена должна быть положительной.",
        42: "Текущая версия модели обучается на синтетических данных и не должна интерпретироваться как модель для реального ценообразования.",
        43: "Рекомендованная цена формируется бизнес-логикой, а не является непосредственным выходом модели машинного обучения.",
        44: "Версия, признаки, целевая переменная и контрольные суммы артефактов должны совпадать с контрактом приложения.",
        45: "API должен корректно обрабатывать неизвестный идентификатор товара и сообщать о сниженной уверенности для данных вне обучающего диапазона.",
        46: "Качество регрессии оценивается метриками MAE и RMSE на отложенной выборке. MAE показывает среднюю абсолютную ошибку в единицах спроса, а RMSE сильнее штрафует крупные отклонения. Эксплуатационная проверка дополняется контрактными тестами, readiness-пробой и контролем корректности диапазонов результата.",
        47: "Таким образом, постановка задачи охватывает не только получение прогноза, но и его безопасную интеграцию в веб-сервис. Результат должен быть воспроизводимым, валидируемым и доступным через документированный HTTP-контракт.",
        49: "Исходные данные формируются воспроизводимым генератором scripts/train_model.py. Такой выбор позволяет проверить полный ML-пайплайн при отсутствии коммерческой истории продаж и исключает включение конфиденциальных данных в репозиторий. Версия набора фиксируется как synthetic-pricing-v1-seed-42.",
        50: "Набор содержит 1000 наблюдений по пяти товарам категорий электроники, товаров для дома, спорта и книг. Для воспроизводимости используется seed 42. Каждая строка соответствует сценарию прогноза и включает четыре входных признака и целевую переменную demand_units.",
        51: "При генерации цена равномерно выбирается в диапазоне от 700 до 2800 условных денежных единиц, горизонт — от 1 до 14 дней, а выходной день встречается примерно в одной трети наблюдений. Спрос рассчитывается с учётом коэффициента категории, обратной зависимости от цены, снижения с ростом горизонта, надбавки выходного дня и случайного шума.",
        52: "Структура одного наблюдения включает следующие поля:",
        53: "product_id — категориальный идентификатор товара.",
        54: "horizon_days — горизонт прогнозирования в днях.",
        55: "current_base_price — текущая базовая цена товара.",
        56: "is_weekend — бинарный календарный признак выходного дня.",
        57: "demand_units — целевая переменная, количество единиц ожидаемого спроса.",
        61: "Перед обучением данные разделяются на обучающую и тестовую части в соотношении 80/20 с фиксированным random_state 42. В результате 800 строк используются для подбора параметров моделей, а 200 строк — только для итогового сравнения качества.",
        62: "Категориальный product_id кодируется компонентом DictVectorizer. Он формирует бинарные признаки по известным товарам и технически допускает обработку нового идентификатора без остановки сервиса. Числовые и логические признаки включаются в ту же матрицу признаков.",
        63: "Готовая модель сохраняется в artifacts/model_v1.pkl, вспомогательная статистика цен — в artifacts/scaler_v1.pkl. Файл artifacts/model_metadata.json содержит версию датасета, дату обучения, тип модели, состав признаков, целевую переменную, метрики и SHA-256 контрольные суммы.",
        64: "Сервис не хранит историю продаж в базе данных. Последние 50 выполненных прогнозов находятся только в памяти процесса и используются для отображения в веб-интерфейсе. После перезапуска приложения эта история очищается.",
        65: "Разделение обучающих данных и оперативных запросов уменьшает связанность компонентов: обучение можно повторить отдельной командой, тогда как API использует неизменяемые версионированные артефакты.",
        66: "Связь входных данных, модели и бизнес-результата представлена на рисунке 1.1.",
        68: "Рисунок 1.1 — Структура данных и формирование результата прогноза",
        69: "На этапе загрузки модельный сервис проверяет, что metadata, pipeline и вспомогательный артефакт относятся к версии v1. Также сопоставляются ожидаемые признаки и target, проверяются контрольные суммы и выполняется тестовый прогноз.",
        70: "Отдельный scaler не масштабирует признаки модели: в текущей реализации он хранит минимальную, максимальную и среднюю цену обучающей выборки. Эти значения используются при расчёте уверенности и инженерных пояснений результата.",
        71: "Таким образом, информационная основа проекта включает воспроизводимый синтетический датасет, сериализованный pipeline, статистику цен и формализованные метаданные. Все элементы, необходимые для инференса и проверки контракта, поставляются вместе с приложением.",
        73: "Разведочный анализ выполнен на тех же 1000 наблюдениях, которые генерируются при обучении model_v1. Проверялись полнота структуры, диапазоны числовых признаков, баланс товаров и календарного признака, а также распределение целевой переменной.",
        74: "Пропущенные значения отсутствуют по построению генератора. Все цены положительны, горизонт находится в допустимом диапазоне, а спрос после добавления шума ограничивается снизу одной единицей. Эти свойства согласованы с Pydantic-валидацией входного API-контракта.",
        75: "Основные характеристики набора данных:",
        76: "Количество наблюдений — 1000, количество уникальных товаров — 5.",
        77: "Цена изменяется от 703,07 до 2798,68, среднее значение составляет 1733,39.",
        78: "Горизонт изменяется от 1 до 14 дней, среднее значение составляет 7,71 дня.",
        79: "Выходные дни представлены 332 наблюдениями, будние — 668 наблюдениями.",
        80: "Целевая переменная demand_units изменяется от 11 до 79 единиц.",
        81: "Средний спрос составляет 31,826 единицы, медиана — 29 единиц.",
        82: "Количество наблюдений по каждому товару находится в диапазоне от 192 до 209, поэтому выраженного дисбаланса категорий нет.",
        83: "Анализ подтверждает заложенную обратную зависимость спроса от цены: при прочих равных увеличение current_base_price уменьшает ценовой коэффициент. Увеличение horizon_days также снижает ожидаемый спрос, а is_weekend повышает его на 14 процентов до добавления случайного шума.",
        84: "Средний спрос различается между товарами из-за коэффициента категории. Наибольшее среднее значение получено для ELEC-100500 — 35,59 единицы, наименьшее для BOOK-777000 — 25,08 единицы.",
        85: "ELEC-100500: 192 наблюдения, средний спрос 35,59 единицы.",
        86: "ELEC-200100: 197 наблюдений, средний спрос 34,71 единицы.",
        87: "HOME-001200: 203 наблюдения, средний спрос 30,71 единицы.",
        88: "SPORT-420000: 199 наблюдений, средний спрос 33,56 единицы.",
        89: "BOOK-777000: 209 наблюдений, средний спрос 25,08 единицы.",
        90: "Различия между товарами заметны, но ни одна категория не доминирует по числу наблюдений; следовательно, сравнение алгоритмов не требует дополнительного взвешивания категорий.",
        91: "Фиксированный seed обеспечивает совпадение статистик между обучением, экспериментальным сравнением и отчетом. Это позволяет повторить расчёты командой python scripts/train_model.py и независимо проверить результаты.",
        92: "Синтетический характер данных является главным ограничением анализа. Набор не содержит сезонность, промо-акции, остатки, цены конкурентов и временную последовательность продаж, поэтому обнаруженные зависимости отражают формулу генератора, а не реальные покупательские процессы.",
        93: "Графическое представление результатов разведочного анализа приведено на рисунке 1.2.",
        95: "Рисунок 1.2 — Распределение спроса и средний спрос по товарам",
        96: "Проведённый анализ подтвердил корректность диапазонов, достаточный баланс товарных идентификаторов и наличие нелинейных зависимостей. Эти свойства обосновывают сравнение линейной модели с алгоритмами на основе деревьев решений.",
        99: "В качестве простейшего baseline использован DummyRegressor со стратегией mean. Он возвращает среднее значение целевой переменной обучающей выборки и показывает уровень ошибки, ниже которого должна работать содержательная модель.",
        100: "Вторым вариантом выбрана LinearRegression. После кодирования product_id она оценивает линейное влияние цены, горизонта и календарного признака. Модель интерпретируема и быстро обучается, однако не описывает нелинейное ограничение ценового коэффициента и взаимодействия признаков.",
        101: "DummyRegressor — константный прогноз среднего спроса.",
        102: "LinearRegression — линейная зависимость после векторизации признаков.",
        103: "DecisionTreeRegressor — одно дерево с max_depth=8 и min_samples_leaf=3.",
        104: "RandomForestRegressor — ансамбль из 120 деревьев с min_samples_leaf=3.",
        105: "Для всех алгоритмов использованы одинаковые 800 обучающих и 200 тестовых наблюдений.",
        106: "В качестве нелинейного baseline дополнительно рассмотрено дерево решений. Ограничение глубины и минимального числа объектов в листе снижает риск точного запоминания синтетической обучающей выборки.",
        107: "Финальный RandomForestRegressor включён в сравнение как ансамблевое развитие дерева решений. Все алгоритмы получают одинаковую матрицу признаков после DictVectorizer и оцениваются на одной отложенной выборке.",
        108: "Для сравнения использованы следующие условия эксперимента:",
        109: "Версия данных synthetic-pricing-v1-seed-42 и 1000 исходных строк.",
        110: "Разделение train/test 80/20 с random_state 42.",
        111: "Единый состав признаков без подбора на тестовой выборке.",
        112: "Метрика MAE для оценки средней абсолютной ошибки.",
        113: "Метрика RMSE для дополнительного штрафа крупных ошибок.",
        114: "Воспроизводимый сценарий scripts/evaluate_models.py с выгрузкой результата в JSON.",
        115: "DummyRegressor показал MAE 11,0784 и RMSE 13,4425. Линейная регрессия уменьшила ошибки до 2,9439 и 3,8456 соответственно, что подтверждает наличие устойчивого сигнала во входных признаках.",
        116: "Полные результаты сравнения представлены в таблице 2.1.",
        117: "Таблица 2.1 — Сравнение базовых моделей по отложенной выборке",
        119: "Наилучшие значения получены RandomForestRegressor: MAE 2,3240 и RMSE 2,9570. Улучшение MAE относительно константного baseline составляет около 79 процентов. Ансамбль также превосходит линейную регрессию и одиночное дерево, поэтому выбран в качестве основы model_v1.",
    }

    for index, text in content.items():
        body = not paragraphs[index].style.name.startswith("Heading") and paragraphs[index].style.name not in {
            "FigCap",
            "TblTitle",
        }
        set_paragraph_text(paragraphs[index], text, body=body)

    paragraphs[90].style = document.styles["Normal"]

    for index in (58, 59, 60):
        remove_paragraph(paragraphs[index])

    for paragraph_index, image_path in ((67, schema_path), (94, eda_path)):
        paragraph = paragraphs[paragraph_index]
        paragraph.clear()
        paragraph.alignment = WD_ALIGN_PARAGRAPH.CENTER
        paragraph.add_run().add_picture(str(image_path), width=Inches(6.2))

    table = document.tables[3]
    rows = [
        ("Модель", "MAE", "RMSE"),
        ("DummyRegressor", "11,0784", "13,4425"),
        ("LinearRegression", "2,9439", "3,8456"),
        ("DecisionTreeRegressor", "2,8489", "3,6965"),
        ("RandomForestRegressor", "2,3240", "2,9570"),
    ]
    while len(table.rows) > len(rows):
        table._tbl.remove(table.rows[-1]._tr)
    for row_index, values in enumerate(rows):
        for column_index, value in enumerate(values):
            set_cell_text(table.cell(row_index, column_index), value)

    document.core_properties.title = "Отчет по проекту AI Pricing Service"
    document.core_properties.subject = "Прогнозирование спроса и расчет рекомендованной цены"
    document.save(OUTPUT)
    print(OUTPUT)


if __name__ == "__main__":
    main()
